{"pageProps":{"post":{"title":"Day 150 - Creating A Design System • Color Contrast","date":"2021-05-30","slug":"day-150","content":"<p>This is the fifth post on the Design System series that I was doing and fourtunately or unfortunately this will be the last post in this 150 day streak of my writing a blog post a day.</p>\n<h2>Breaking The 150 Day Streak</h2>\n<p>From now on I will be writing one post a week maybe but will not stop writing. Current post of mine are not that much helpful and I know that but all I was trying to do was just making a habit of writing something and in doing so learn something new.</p>\n<p>Because of this writing everyday and on some programming and computer related stuff I think I have learned alot mostly about Operating Systems and Web Development. Now that aside lets get back to Design System.</p>\n<h2>Color Contrast</h2>\n<p>This post wasupposed to be about Grid &#x26; Layout but now I am thinking of doing it about Colors again. The reason I am doing this about colors agian is beacuse of color contrast. In this Day 146 I choosed colors for this design system but I choosed them randomly without even thinking about the color contrast issue.</p>\n<p>Recently while researching for different Design Systems and how they do the selection of colors and do research on designing different elements of the web I came along this article by W3 which states that there must be a contrast of 4.5:1 for it to have \"enough contrast between text and its background so that it can be read by people with moderately low vision (who do not use contrast-enhancing assistive technology)\". So I checked my colors with contrast checking tool on the web and most of the colors which I randomly selected were not meeting the requirement except for the purple color.</p>\n<p>So before going anywhere else I decided to first correct all the colors and their contrast so that they look good and also accessible for all. Following are the colors that I previously had.</p>\n<pre><code class=\"language-scss\">$gray: #8d99ae;\r\n$red: #ec4740;\r\n$green: #28a745;\r\n$blue: #0087e6;\r\n$yellow: #ffbd00;\r\n$orange: #ff6d00;\r\n$purple: #7400b8;\r\n$pink: #bf36b4;\n</code></pre>\n<h2>Contrast Checking &#x26; New Colors</h2>\n<p>Next what I did is one by had the color copied on to the Color Contrast Checker and altered the colors slightly so that they meet the contrast requirment of 4.5:1.</p>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>HEX</th>\n<th>CWWB</th>\n<th>CWBB</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Red</td>\n<td>#d93a49</td>\n<td>4.51</td>\n<td>4.65</td>\n</tr>\n<tr>\n<td>Green</td>\n<td>#158843</td>\n<td>4.53</td>\n<td>4.63</td>\n</tr>\n<tr>\n<td>Blue</td>\n<td>#0079CF</td>\n<td>4.53</td>\n<td>4.64</td>\n</tr>\n<tr>\n<td>Yellow</td>\n<td>#FFBB00</td>\n<td>1.70</td>\n<td>12.36</td>\n</tr>\n<tr>\n<td>Orange</td>\n<td>#FF6D00</td>\n<td>2.82</td>\n<td>7.44</td>\n</tr>\n<tr>\n<td>Purple</td>\n<td>#8D00DF</td>\n<td>6.57</td>\n<td>3.20</td>\n</tr>\n<tr>\n<td>Pink</td>\n<td>#CC2BBE</td>\n<td>4.51</td>\n<td>4.66</td>\n</tr>\n<tr>\n<td>Gray</td>\n<td>#b5b5b5</td>\n<td>2.05</td>\n<td>10.24</td>\n</tr>\n</tbody>\n</table>\n<p>Now these are the new colors that I will be including in the Design System but you see here that not all the colors match the ratings of 4.5:1 that I mentioned above. That is because that the colors that do not match the ratings are light colors like yellow and orange and gray. This is becuase majority of the users use the light theme with white backgorund applications and it would be not a good design to use a light color on a white background. You wouldn't even see the color.</p>\n<h2>What's Next</h2>\n<p>So that's it for now and probably for some days. I wanted to end this a few weeks ago already but also not wanted to. Right now if you had to look at the commit history of this blog you would see that most of the post of that day were not updated on the day they were supposed to. That because It was getting difficult for me to write every day and also spend time on other projects.</p>\n<p>So from now on I will be (for now) writing a blog and week or two and spend more time on building something useful and learn new things in doing so. See You Soon.</p>\n","tags":["Design-System","Design","CSS"]}},"__N_SSG":true}