{"pageProps":{"post":{"title":"Day 48 - BASH Scripting In Linux","date":"2021-02-17","slug":"day-48","content":"<p>A Shell is a command interpreter or an interface between a computer's OS and the user that enables the user to manipulate files and run commands, programs etc.</p>\n<p>There are many shells available for Linux like Zsh or Z-Shell and C Shell but here we are only going to talk about BASH or Bourne-Again Shell because BASH is very widely used and comes pre-installed in most of the Linux Distros and also in MAC-OS and other UNIX like OS.</p>\n<h2>BASH Scripting</h2>\n<p>Scripting allows us to run multiple commands automatically at a time that if done by a human would have to type one after another. BASH Scripting a script written to be executed by the BASH.</p>\n<p>To write a script we need a Text-Editor and for that I will be using VI because it comes pre-installed with Linux.</p>\n<pre><code class=\"language-bash\">Linux> touch newscript\r\nLinux> sudo vi newscript\r\n#! /bin/bash\r\necho \"This is a simple bash script\"\r\n\n</code></pre>\n<p>This script written above has two lines in it, the first one start with <code>#</code> and <code>!</code> which is called a <strong>shebang</strong> and after that we define what shell should run this script which is <code>/bin/bash</code></p>\n<p>The second one is an actual command that we use in the shell. We learned about some commands in <a href=\"/day-34/\">Day-34</a> and <a href=\"/day-41/\">Day-41</a>.</p>\n<p>Any newly created script file is not executeable by default so you have to add execute permission to the file that we talked about in <a href=\"/day-39/\">Day-39</a>. After adding permission to we can run it in the shell.</p>\n<pre><code class=\"language-bash\">Linux> ./newscript\r\nThis is a simple bash script\n</code></pre>\n<h3>Variables and Input In BASH Script</h3>\n<p>You can use vaiables and ask for input from the user to add more functionality in your BASH scripts.</p>\n<pre><code class=\"language-bash\">Linux> touch secscript.sh\r\nLinux> sudo vi secscript.sh\r\n#! /bin/bash\r\necho \"What's your name?\"\r\nread name\r\necho \"Hello There, \" $name\n</code></pre>\n<p>Here a new keyword is used which is <code>read</code> which is used to read the the text that you input in the shell before you hit enter and the <code>name</code> after the <code>read</code> is a varibale that stores the string that you type in the shell. Now after adding permissions to it I will run the script.</p>\n<pre><code class=\"language-bash\">Linux> ./secscript.sh\r\nWhat's your name?\r\nLinus\r\nHello There, Linus\n</code></pre>\n<h3>Example Script</h3>\n<pre><code class=\"language-bash\">!# /bin/bash\r\nnmap -sT 192.168.10.0/24 > script-results\r\ncat script-results | grep open > open-ports\r\ncat open-ports\n</code></pre>\n<p>This script will search for all open ports on the netwrok using nmap and save the output result in the <code>script-result</code> file and then <code>grep</code> is used to filter out lines and save these lines in <code>open-ports</code> file which then cat commands prints out. This is a very simple script but more complex ones can be written using common keywords that are available to us for use in the scripts.</p>\n<h3>Common Built-in BASH Commands</h3>\n<p>Thses are the most common built-in BASH commands that can be used just like a programming language to write more complex scripts.</p>\n<table>\n<thead>\n<tr>\n<th>Command</th>\n<th>Function</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>cd</td>\n<td>Changes Directory</td>\n</tr>\n<tr>\n<td>echo</td>\n<td>Displays the arugment in shell</td>\n</tr>\n<tr>\n<td>exit</td>\n<td>Exits the shell</td>\n</tr>\n<tr>\n<td>bg</td>\n<td>Puts a job in the background</td>\n</tr>\n<tr>\n<td>fg</td>\n<td>Puts a job in the foreground</td>\n</tr>\n<tr>\n<td>jobs</td>\n<td>Displays list of background jobs</td>\n</tr>\n<tr>\n<td>read</td>\n<td>Reads a user input</td>\n</tr>\n<tr>\n<td>export</td>\n<td>Make a variable available to other programs</td>\n</tr>\n<tr>\n<td>readonly</td>\n<td>Declares a varibale as readonly</td>\n</tr>\n<tr>\n<td>set</td>\n<td>Displays list of all vaiables</td>\n</tr>\n<tr>\n<td>unset</td>\n<td>Deletes values from a variable</td>\n</tr>\n<tr>\n<td>wait</td>\n<td>Waits for a background process to complete</td>\n</tr>\n<tr>\n<td>test</td>\n<td>Evaluates arguments</td>\n</tr>\n<tr>\n<td>exec</td>\n<td>Executes a command without creating a new process</td>\n</tr>\n</tbody>\n</table>\n<p>These are some common commands that I rememmber but there are alot of them that can help in creating more useful scripts. Scripting is essential for automating tasks and being more productive in using the Linux and the Shell.</p>\n","tags":["Linux"]}},"__N_SSG":true}