{"pageProps":{"post":{"title":"Day 74 - Threads","date":"2021-03-15","slug":"day-74","content":"<p>A thread is a basic unit of CPU utilization. It is also called a <strong>lightweight process</strong>. It behaves like a process in a process and does not have its own process control block. Usually multiple threads are created with a single process. If a process has multiple threads it can perform multiple tasks at the same time.</p>\n<p>A thread consists of the following.</p>\n<ul>\n<li>Thread ID</li>\n<li>Program Counter</li>\n<li>Register Set</li>\n<li>Stack</li>\n</ul>\n<p>A thread share the following with its peer threads in a particular task:</p>\n<ul>\n<li>Code Section</li>\n<li>Data Section</li>\n<li>Operating System source available to the task, such as open files and signals.</li>\n</ul>\n<p><img src=\"/assets/images/day-74/threading.jpg\" alt=\"Single vs Multi-Thread Process\"></p>\n<p>Modern computers have multiple process all running multiple threads to do more work at the same time. For example a browser might be running a single thread for displaying images and other thread to render html pages or a word processing program can have a thread for spellchecking and other thread for displaying graphics.</p>\n<p>Another more common example of using multi-threads process is in web-servers. A web-server may be serving many requests at the same time and if it were to be a single-thread process it would only serve one user at a time. Instead a server creates a thread for every reuqest it get from a client and serves the client with the requested data like HTML pages or images etc.</p>\n<h3>Benefits Of Multi-threading Processes</h3>\n<p>There are four major benefits of Multi-Threadinf Processes.</p>\n<ol>\n<li><strong>Responsiveness.</strong> A program's responsiveness to the user can be increased my multithreading the process. This will cause the program to run some of its parts even if one or two are been blocked by something.</li>\n<li><strong>Resource Sharing.</strong> Processes can share memory through techniques like shared memory and message passing. and these techniques must be explicitly arranged by the programmer.</li>\n<li><strong>Economy.</strong> Multithreading is more economical because the threads can share the resources of the same process to which they belong.</li>\n<li><strong>Scalability.</strong> The benefits of multithreading can be even greater in a multiprocessor architecture, where threads may be running in parallel on different processing cores.</li>\n</ol>\n","tags":["Operating-Systems"]}},"__N_SSG":true}