{"pageProps":{"post":{"title":"Day 146 - Creating A Design System • Colors","date":"2021-05-26","slug":"day-146","content":"<p>What is a Design System? This is the question to which I will answer by learning and creating a Design System of my own for a project. But first of all what is a Design System. A Design System according to Wikipedia is \"a set of interconnected patterns and shared practices coherently organized whihc aid in digital product design and development of products such as apps or websites\".</p>\n<p>For most of my projects I use Bootstrap's coloring scheme and sometimes button styles or GitHubs coloring scheme for colors for dark and light theme styling as designing these things for yourself is pretty difficult. Every time I try to create a color pelette for my some project I fail to do so and get someone else's colors for the project becuase if one color looks good but some other does not I change it with a new one but then some other color does not look good with the new one that I have and this continues into infinte loop where the only way to get out of it is to not do it.</p>\n<p>But now for some time I have been thinking of doing this once and for all of creating a little Design System for myself and learn something new in the process. This Design System will have following parts.</p>\n<ul>\n<li>Color Scheme</li>\n<li>Typography</li>\n<li>Sizing &#x26; Spcaing</li>\n<li>Buttons &#x26; Forms</li>\n<li>Grid &#x26; Layout</li>\n</ul>\n<h2>Benefits Of A Design System</h2>\n<p>A Design System can help us by following ways:</p>\n<ul>\n<li>Single Souce of Truth</li>\n<li>Time/Cost Saving</li>\n<li>Increases Consistency</li>\n</ul>\n<p>Also I will be making this design system completely in SASS and not in some app like Figma or Illustrator. So I could compile it to CSS and use it in the web project.</p>\n<h2>Color</h2>\n<p>First of all come the colors. So there must be a primary color and a secondary color for your design system and after spending some time on the internet I found these ones. From these ones I will be selecting a primary color and a secondary color.</p>\n<pre><code class=\"language-scss\">$colors: (\r\n  \"gray\": #8d99ae,\r\n  \"red\": #ec4740,\r\n  \"green\": #28a745,\r\n  \"blue\": #0087e6,\r\n  \"yellow\": #ffbd00,\r\n  \"orange\": #ff6d00,\r\n  \"purple\": #7400b8,\r\n  \"pink\": #bf36b4,\r\n);\n</code></pre>\n<h2>Tints &#x26; Shades</h2>\n<p>Next we should create tints/shades of these colors. Most of the systems that I looked have 5 to 9 variants of all the colors they have in thier system. To create tints and shades for these colors I use the following functions in SCSS.</p>\n<pre><code class=\"language-scss\">@function tint($color, $percent) {\r\n  @return mix(white, $color, $percent);\r\n}\r\n\r\n@function shade($color, $percent) {\r\n  @return mix(black, $color, $percent);\r\n}\n</code></pre>\n<p>We loop through the <code>$colors</code> array in the SCSS file and use the above mentioned functions to create tints and shades of the colors. For my colors after some testing I have decided to use the following percentages of tint and shade. You can use whatever you like the most for your colors.</p>\n<pre><code class=\"language-scss\">:root {\r\n  @each $color-name, $color in $colors {\r\n    --#{$color-name}-100: #{tint($color, 80%)};\r\n    --#{$color-name}-200: #{tint($color, 60%)};\r\n    --#{$color-name}-300: #{tint($color, 40%)};\r\n    --#{$color-name}-400: #{tint($color, 20%)};\r\n    --#{$color-name}-500: #{$color};\r\n    --#{$color-name}-600: #{shade($color, 20%)};\r\n    --#{$color-name}-700: #{shade($color, 40%)};\r\n    --#{$color-name}-800: #{shade($color, 60%)};\r\n    --#{$color-name}-900: #{shade($color, 80%)};\r\n  }\r\n}\n</code></pre>\n<p>After compiling these I got the following results.</p>\n<p><img src=\"/assets/images/day-146/colors.jpg\" alt=\"Color Variants\"></p>\n<p>Next stuff will be about Typography.</p>\n","tags":["Design-System","Design","CSS"]}},"__N_SSG":true}