{"pageProps":{"post":{"title":"Day 136 - State Management In Redux","date":"2021-05-16","slug":"day-136","content":"<p>Back to business and the first thing we will be learning about is called Redux. Anyone who build UIs with JavaScript will come across problems with handeling state of the app where you have to update one thing in one place but it must be update everywhere else it is used.</p>\n<p>For example when building a user authencation in UIs we have to make sure that the user must not get what he/she does not have access to and to do that we have to know who is autheticated and what they have access to at and this information must be available to all the components of the app and must be updated everytime and everywhere. That is why state management is so important.</p>\n<p>When working with JS frameworks like React and Angular we need some way to manage state in all parts of the app. React have Context Hook but there is more powerful way to manage state in React and other frameworks. This is by using Redux.</p>\n<h3>What is Redux?</h3>\n<p>Redux is a State Management Library. It can be used with any JS framework not just with React and even with Vanila JS projects to manage state of the application. Redux uses a Store to store all the properties of an application. Its the single source of truth for the app and will be updated everytime a property inside the store is updated.</p>\n<p>But why use Redux?</p>\n<ul>\n<li>Predictable state changes</li>\n<li>Centralized state</li>\n<li>Easily Debugable with Redux DevTools</li>\n<li>Large ecosystem of addons and tools</li>\n<li>Works with all JS Frameworks and Vanila JS</li>\n<li>And many more</li>\n</ul>\n<h3>Installing Redux</h3>\n<p>To get started with Redux first you have to install it and to do so we use npm.</p>\n<pre><code class=\"language-bash\">Linux >> npm install redux\n</code></pre>\n<p>But this will install the redux core library and to use it in react project we have to install the react bindings for redux as well.</p>\n<pre><code class=\"language-bash\">Linux >> npm install redux react-redux\n</code></pre>\n<p>Next we will be looking at the core concepts of Redux.</p>\n","tags":["Redux","JavaScript","React"]}},"__N_SSG":true}