{"pageProps":{"post":{"title":"Day 30 - Saturday, January 30, 2021","date":"2021-01-30","slug":"day-30","content":"<p><img src=\"/assets/images/day-30/telephone-lines.jpg\" alt=\"Telephone Lines\"></p>\n<p>This the the seventh post in the Networking Series and last time we discussed about <a href=\"/day-29/\">IP and MAC addresses</a> and for today the topic is about two of the most common types of computer networks, LAN and WAN.</p>\n<p><a href=\"/day-24/\">Computer Networks</a> are categorized by many things like their scale, properties or the place of use and there are many types of computer networks in use today. They are also categorized by their geographical or local scale. The WAN and LAN are two primary and most known types of Computer Netowrks.</p>\n<h2>What is a LAN?</h2>\n<p>LAN or Local Area Network is a type of Computer Network that connects the devices over a short distance. Common examples of LAN are a Home Network or an Office Network. Some buildings can have more than one LANs connected with each other. LAN is controlled by either a signle person or an organization.</p>\n<p>Ethernet and Wi-Fi are two most common types of technologies used to form a LAN. Nowadays wireless connectivity is gaining more popularity because of its easy to connect and use but Ethernet connections are more reliable and secure than wireless connections.</p>\n<h2>What is a WAN?</h2>\n<p>WAN or Wide Area Network is a type of Computer Network that connects the devices or other smaller networks over a wide area or geogrphical distance. Internet is the most widely known example of the WAN. A WAN consists of many LANs connected together. A device called <a href=\"/day-25/\">Router</a> is used to connect a LAN to a WAN. Unline a LAN, WAN (like Internet) is not controlled by a single person or organization rather many organizations manage certain parts of a WAN.</p>\n<p>WAN uses Cables, Telephone Lines and Air Waves technologies for communication channels. WAN operates on Lower Three Layers of the <a href=\"/day-28/\">OSI Model</a>, Network, Data Link and Physical Layer.</p>\n<h2>Other Types of Networks</h2>\n<p>Some other common types of Networks are following:</p>\n<ul>\n<li>PAN: <a href=\"https://en.wikipedia.org/wiki/Personal_area_network\">Personal Area Network</a></li>\n<li>SAN: <a href=\"https://en.wikipedia.org/wiki/Storage_area_network\">Storage Area Network</a></li>\n<li>CAN: <a href=\"https://en.wikipedia.org/wiki/Campus_area_network\">Campus Area Network</a></li>\n<li>HAN: <a href=\"https://en.wikipedia.org/wiki/Home_area_network\">Home Area Network</a></li>\n<li>VPN: <a href=\"https://en.wikipedia.org/wiki/Virtual_private_network\">Virtual Private Network</a></li>\n</ul>\n<p>and many more.</p>\n","tags":["Networking"]}},"__N_SSG":true}