{"pageProps":{"post":{"title":"Day 26 - Tuesday, Januray 26, 2021","date":"2021-01-26","slug":"day-26","content":"<p><img src=\"/assets/images/day-26/protocol.jpg\" alt=\"Ethernet Cable\"></p>\n<p>So far we have discussed what is a network and what are some network devices and now we will discuss what is a protocol and what are some common Communication and Network Protcols.</p>\n<h2>What is a Protocol?</h2>\n<p>A Protocol is a standard used by a network for communication betweem the devices that are connected to a network. It is kind of an agreement between devices that are connected to the network. What is communicated, how it will be communicated and when are all the things that are defined by the protocols.\r\nProtocols can be implemented by physical hardware or software or by both. The devices cannot communicate without a protocol.\r\nFunctions that a protocol handles are:</p>\n<ul>\n<li>Data Sequencing - Dividing large messages into smaller packets to easily send and receive and numbering them to check if the whole message is received or else ask for the lost packet.</li>\n<li>Data Routing - Finding the most efficient path to communicate between devices to increase the efficieny of the network.</li>\n<li>Data Flow - Properly handeling the data flow between devices that may not have the same computing power.</li>\n<li>Error Handeling - Detecting and recovering the erros that come along the way during the communicatons.</li>\n</ul>\n<h2>Common Communication and Netwrok Protocols</h2>\n<p>Following are some standards that are either approved by a recognized industry or are adopted as a standard by the Communication Industry.</p>\n<ul>\n<li>\n<p>Ethernet - The Protocol that you all have already seen. This protocol is used on wired network and is inexpensive to install and have a data transfer rate of about 10 Mbps to 100 Gbps.</p>\n</li>\n<li>\n<p>TCP/IP - Internet Protocol Suite or TCP/IP (Transmission Control Protocol / Internet Protocol) is the most widely used communication protocol today and is used in the Internet and simillar types of computer networks. It consists of two protocols working together, TCP and IP.</p>\n<ul>\n<li>TCP or Transmission Control Protocol - The protocol that handle the delivery and transmission or data on the internet and other networks of the same kind.</li>\n<li>IP or Internet Protocol - The protocol that handles the addressing and routing of the information on the internet.</li>\n</ul>\n</li>\n<li>\n<p>Bluetooth - It is a wireless technology used in mobile phones and small fixed devices and for using over short ranges.</p>\n</li>\n<li>\n<p>Wi-Fi - Wi-Fi is also a family of wireless network protocols are used for locally connected networks for the access to the internet. The devices that can connect to a Wi-Fi includes Mobile Phones, Cars, Printer, Speaker, Personal Computers, Laptops and many more.</p>\n</li>\n</ul>\n","tags":["Networking"]}},"__N_SSG":true}