{"pageProps":{"post":{"title":"Day 28 - Thursday, January 28, 2021","date":"2021-01-28","slug":"day-28","content":"<p><img src=\"/assets/images/day-28/cables.jpg\" alt=\"Cables\"></p>\n<p>The <strong>Open System Interconncetion</strong> Model is a conceptual model that defines a set of protocols that allows any device even if they have different architectures to form a computer network. It was created by Internation Organization for Standardization in 1983. It can be seen as a universal langauge for the computer networks to communicate.</p>\n<p>The OSI Model consists of seven layers and each layer defines the part of the process of sharing information accross the network.</p>\n<pre><code class=\"language-css\">7. Application Layer\r\n6. Presentation Layer\r\n5. Session Layer\r\n4. Transport Layer\r\n3. Network Layer\r\n2. Data Link Layer\r\n1. Physical Layer\n</code></pre>\n<p>Each layer performs a specific task that is different from other layers and by using the services of the layer below it. When two deviecs communicate, one layer on one device communicate with the same layer on the other device. This communication takes place according to the protocols.\r\nNow on to what each layers actually does.</p>\n<h3>Layer 7 - Application Layer</h3>\n<p>The Application Layer is the layer that the user directly contacts with. It provides services through application on the users device connected to a network. For example the web-browser relies on the Application Layer to provide data for the user to interact with.\r\nExample - You type <code>google.com</code> in the browser's URL bar and hit enter. The Application Layer will get the query <code>google.com</code> from the browser and selects a protocol for it (HTTP in this case) and passes the data to the Presentaiton Layer to furthur process.</p>\n<p><img src=\"url_bar.jpg\" alt=\"URL Bar\"></p>\n<h3>Layer 6 - Presentation Layer</h3>\n<p>The Presentation Layer is the layer that translates, compresses and encrypts the user data that it receives from the Application Layer. Common protocols that are used in Layer 6 are NFS and SMB etc.\r\nExample - After receiving data from the Application Layer the Presentation Layer will compresses the data or encrypts it if needed and then pass it to the Session Layer below it.</p>\n<h3>Layer 5 - Session Layer</h3>\n<p>The Session Layer establishes and manages the connections between the devices on the network. A Sessoion is an exchange of messages between computers. It maintains connections and control ports and sessions. It also ensures to open the connection for long enough to for all the data to be exchange without any loss and then closes the connection.\r\nExample - After receiving the compressed data from the Layer 6, the Session Layer will open the connection or session between the sender and receiver's device and closes it when all exchange is successfully done.</p>\n<h3>Layer 4 - Transport Layer</h3>\n<p>The Transport Layer is responsible for end-to-end communication and tranfer of data between two devices.This Layer will divide the data into smaller units called segments for easy and lossless transfer. It performs error checks to ensure all the segments are reveiced or sent and if not it will ask for the lost segments. Some popular protocols that operate on Transport Layer are TCP and UDP etc.\r\nExample - After receiveing data from the Layer 5, Transport Layer will divide the data into smaller chunks and will select the protocol for it. These segments are then passed to Network Layer.</p>\n<h3>Layer 3 - Network Layer</h3>\n<p>The Network Layer decides the physical path the packets will take to reach their destination. The network layer furthur divides the segments from Layer 4 to smaller units called packets. Network Layer manages the packets and find the best path for the data to take to reach it destinatio called routing. Common protocols that operate on Network Layer are IP and X.25 etc.\r\nExample - After receiving segments of the browser's query from the Transport Layer, Network Layer will divide them into smaller packets and will the find the best path for the packets to pass through to reach thier destination. Passing through Data Link Layer.</p>\n<h3>Layer 2 - Data Link Layer</h3>\n<p>The Data Link Layer works simmilary to Network Layer but for the devices on the SAME network. It will furthur divide the packets into even smaller units called frames and just like Network Layer it will control flow and check for errors during the data transfer between the devices on the same network.\r\nExample - After receiving packets from the Network Layer, Data Link layer breaks them into frames and pass them to Physical Layer.</p>\n<h3>Layer 1 - Physical Layer</h3>\n<p>The Physical Layer is the physical connection between the devices on the network. This includes all the cables and switches, routers etc. At Physical Layer the frames are convert to bits of 1s and 0s and then trasnmits raw stream of bits to the other device.\r\nExample - After receiving frames from the Data Link Layer, The Physical Layer converts them into a stream of bits and transmits them to the <code>googel.com</code> server. The server as a response sends the HTML document which will follow all the same rules as above to reach your device and after reaching your device, all the steps will be followed again but oppositely and you will see this in your browser window.</p>\n<p><img src=\"google.jpg\" alt=\"Google Seach Page\"></p>\n","tags":["Networking"]}},"__N_SSG":true}