{"pageProps":{"post":{"title":"Day 24 - Sunday, January 24, 2021","date":"2021-01-24","slug":"day-24","content":"<p><img src=\"/assets/images/day-24/network.jpg\" alt=\"Network\"></p>\n<p>This is the first post in a series of post that I will be writing on Networking from the ground-up. I know a little about networking but I will be learning some basics that I don't know already and will be diving deep into it. Starting with the most basic of the question in networking.</p>\n<h2>What is a Network?</h2>\n<p>A network is a collection of computers connected together through wires or wirelessely for sharing of resources and information. Both hardware and software are necessary to form a network. Networks work on the principles of Network Protocols. And there are many classifications of Computer Networks.</p>\n<h2>Classifications of Computer Networks</h2>\n<p>Computer Networks are classified into many types but I will discuss about two only, LAN and WAN.</p>\n<h3>LAN or Local Area Network</h3>\n<p><a href=\"https://en.wikipedia.org/wiki/Local_area_network\">LAN</a> short for Local Area Network is a type of Computer Network where computers or other devices connected with each other are within a limited area like the computers at an Office are connected with each other are an example of Local Area Network.</p>\n<h3>WAN or Wide Area Network</h3>\n<p><a href=\"https://en.wikipedia.org/wiki/Wide_area_network\">WAN</a> short for Wide Area Network is a type of computer netwrok where devices connected to form a network are extended over a wide geographical area. Internet is the most famous example of the WAN where billions of devices are connected with each other to share data and information.</p>\n<h2>Network Topology</h2>\n<p>Networks are designed in many ways depending on the location or the budgest the network can use one of the <a href=\"https://en.wikipedia.org/wiki/Network_topology\">Network Topologies</a> to connect all the computers together. For example in a <a href=\"https://en.wikipedia.org/wiki/Star_network\">Star Topology layout</a>, all the computers are connected with a single computer to form a network.</p>\n<h2>Communication Protocols</h2>\n<p>The Communications Protocols are set of rules for exchange of information over a network. Some examples of commonly used protocols are <a href=\"https://en.wikipedia.org/wiki/Internet_Protocol_Suite\">Internet Protocol Suite (TCP/IP)</a>, <a href=\"https://en.wikipedia.org/wiki/IEEE_802\">IEEE 802</a> and <a href=\"https://en.wikipedia.org/wiki/Ethernet\">Ethernet</a> etc.</p>\n<h2>Hardware and Software</h2>\n<p>Hardware and Software both are necessary for a computer network to work. Network cables, Access Points, Modems and Router are some devices that form the network plus a network operating systems are required for the networks to function properly.</p>\n<p>The Computer Networks are what caused the World Wide Web to emerge into becoming what it is today and society of today cannot function without the use of web and the computer networks.</p>\n<hr>\n<p>Some changes that I will make from today to this blog are that I will not write Kanji down in the posts and I will write in series where I will choose a topic and learn and write it to better understand it.</p>\n<blockquote>\n<p>\"If You Can’t Explain It Simply, You Don’t Understand It Well Enough\"\r\nAlbert Einstein</p>\n</blockquote>\n<blockquote>\n<p>\"I am not sure if he actually said this ^\" zainsci</p>\n</blockquote>\n","tags":["Networking"]}},"__N_SSG":true}