{"pageProps":{"post":{"title":"Day 53 - Insertion Sort","date":"2021-02-22","slug":"day-53","content":"<p>Insertion Sort is a simple sorting algorithm that sorts a list of elements one element at a time. In simple words, Insertion sort takes a list as an input, sorts the list by changing the position of one element at a time. Insertion sort is a very simple algorithm for sorting lists but it also have its advantages.</p>\n<p>Insertion Sort is:</p>\n<ul>\n<li>Easy to implement than other sorting algorithms</li>\n<li>Very efficient in sorting small size lists</li>\n<li>Require a constant amount of memory for the process</li>\n<li>Sorts a list as it receives it</li>\n<li>More efficient in practice than most of the sorting algorithms</li>\n</ul>\n<p>Insertion sort works the same way as most people sort playing cards. Comparing the card with the other card and swapping one card at a time.</p>\n<h2>How it works?</h2>\n<p>Insertion sort takes a list of elements as an input. The algorithm will always assumes the first element as sorted and iterates over all other elements of the list one by one and checks each element with it previuos element. If the previous element is bigger than the current element it will swap them both and then again checks the previous element until the element is at the right position. It iterates over all the elements until the list is sorted.</p>\n<p><img src=\"/assets/images/day-53/insertion-sort.jpg\" alt=\"Insertion Sort\"></p>\n<p><small>Figure from Introduction to Algorithms by MIT Press</small></p>\n<h2>Implementation</h2>\n<p>Here's a simple implementation of insertion sort in Python.</p>\n<pre><code class=\"language-py\">nums = [4, 7, 3, 1, 5, 8, 0, 6, 9, 2]\r\n\r\ni = 1\r\nwhile i &#x3C; len(nums):\r\n    j = i\r\n\r\n    \"\"\" Iterates j times to check if the element\r\n    is at the right position \"\"\"\r\n    while j > 0 and nums[j-1] > nums[j]:\r\n        nums[j], nums[j-1] = nums[j-1], nums[j] # element swapping\r\n        j = j-1\r\n\r\n    i = i+1\r\n\r\nprint(nums) # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]\n</code></pre>\n<h2>Complesity</h2>\n<p>The Complexity of Insertion Sort in Best, Worst and Average Case is as follows.</p>\n<h3>In Best Case</h3>\n<p>Considering that the provided list is already sorted, Insertion sort will have complexity of O(n) or Linear Complexity. It will only check for one element on each iteration and will takes n steps to sort the list if the lenght of list is n.</p>\n<h3>In Worst Case</h3>\n<p>Considering that the provided list is already sorted in the reverse order, Insertion sort will have the complexity of O(n^2) or Quadratic Complexity. It will iterate over all the elements one by one and swap evey element that comes before the current element until the list is completely sorted.</p>\n<pre><code class=\"language-md\">list = [9, 8, 7, 6, 5, 4, 3, 2, 1]\r\n0- [9, 8, 7, 6, 5, 4, 3, 2, 1]\r\n1- [8, 9, 7, 6, 5, 4, 3, 2, 1]\r\n2- [8, 7, 9, 6, 5, 4, 3, 2, 1]\r\n3- [7, 8, 9, 6, 5, 4, 3, 2, 1]\r\n4- [7, 8, 6, 9, 5, 4, 3, 2, 1]\r\n...\r\n...\r\n37- [1, 2, 3, 4, 5, 6, 7, 8, 9]\n</code></pre>\n<p>The bigger the list more time and steps it will take to sort an unordered list with insertion sort.</p>\n<h3>In Average Case</h3>\n<p>The same goes for Average Case with insertion as was with Worst Case having the time complexity of O(n^2).</p>\n<p>Insertion sort was easy and simple one but I don't think next ones will be as simple, So let's see what will happen.</p>\n","tags":["Data-Structures","Algorithms"]}},"__N_SSG":true}