{"pageProps":{"post":{"title":"Day 128 - Migrating From GatsbyJS To NextJS [0]","date":"2021-05-08","slug":"day-128","content":"<p>I started this blog at the start of this year and when i started this I thought of building this blog with a JS framework and for that i deceided react and also becasue it was so much to easy to work with comparing to other frameworks. Then I decided to build this using GatsbyJS because I wanted this to be SEO friendly and CRA was not providing anything like that and I was not sure about the NextJS.</p>\n<p>So I built this site with GatsbyJS and after 100 days or before that I started working with NextJS. I decided to learn NextJS to built a website for someone I knew and it was also much easier to work with than GatsbyJS. By easy I mean that in GatsbyJS you have to install plugins and do configurations etc to add extra functionality and so.</p>\n<p>It is same in NextJS, that is to add some extra functionality or using third-party packages in the codebase. But comparing to GatsbyJS it is much easier in my opinion.</p>\n<p>Then later last month I built my <a href=\"zainsci.github.io\">Personal Website</a> with NextJS with a new design and a Dark Theme Feature. So I decided to rebuilt this blog with NextJS and change styling and add a Dark Mode to it too. But how am I going to do it.</p>\n<h3>Removing GatsbyJS Related Files</h3>\n<p>To start with I created a new git branch with name <code>next</code> and removed all <code>gatsby-*.js</code> files.</p>\n<pre><code class=\"language-bash\">zainsci@zainsci-PC /d/zainsci-blog (next)\r\n$ git checkout -b next\r\nSwitched to new branch \"next\"\r\nzainsci@zainsci-PC /d/zainsci-blog (next)\r\n$ ls\r\ncontent            gatsby-config.js  LICENSE       package.json\r\nREADME.md          static            yarn.lock     gatsby-browser.js\r\ngatsby-node.js     node_modules      package-lock.json\r\nsrc                styles\n</code></pre>\n<p>Then i removed all the gatsby related packages from the <code>package.json</code> file and after that installed <code>next</code> with npm along with other packages like <code>remark</code> and <code>remakr-html</code> as I will be needing these when converting markdown files to html.</p>\n<pre><code class=\"language-bash\">zainsci@zainsci-PC /d/zainsci-blog (next)\r\n$ npm install next remark remark-html\n</code></pre>\n<p>Gatsby keeps all the files js and other source code files in the <code>src</code> dir while NextJS in the root dir. Currently my src folder looks like this.</p>\n<pre><code class=\"language-bash\">zainsci@zainsci-PC /d/zainsci-blog (next)\r\n$ ls src\r\ncomponent   css  pages  templates\n</code></pre>\n<p><code>components</code> include react components like navbar and footer etc, pages include pages like <code>404.js</code> and <code>index.js</code> and so and templates include template for blog post page and css. <code>pages</code> and <code>templates</code> are created by the GatsbyCLI.</p>\n<p>I moved the <code>components</code>, <code>pages</code> and <code>templates</code> dir to the root dir, moved the <code>templates</code> folder files to <code>pages</code> folder as they will be usefull there and removed the <code>src</code> folder along with the css as I will be rewriting all the css for the blog.</p>\n<h3>Static Files</h3>\n<p>Gatsby keeps all the static files in the static folder by default and Next keeps static files in the public folder by default so I renamed the static to public and before that removed the public dir that GatsbyCLI creates as a result of rendering static pages.</p>\n<p>Here came a problem for me that I will be discussing in the next post. As in the list above of all the files and folders in the root dir there is a <code>content</code> dir that is used to keep all the markdown files for the blog in a folder called <code>blog</code> and other assets like images and such in dir <code>assets</code>. It is like another static folder for the blog.</p>\n<h3>Removing Gatsby Related Code</h3>\n<p>After moving and deleting all necessary files I added scripts for the NextJS in package.json file and started the dev server. The server one by one helped me in removing all the unnecessary code and at the end I was left with an empty page in the browser at <code>localhost:3000</code>. And I will explain the remaining in the next or next next post.</p>\n","tags":["GatsbyJS","NextJS","JavaScript"]}},"__N_SSG":true}