{"pageProps":{"post":{"title":"Day 45 - Instaling, Updating, Removing Software In Linux","date":"2021-02-14","slug":"day-45","content":"<p>This is the fourtheenth post in the Linux Series and in this I will try to explain how to install and remove softwares and some common functions related to it in the Linux OS.</p>\n<p>There comes a time when you need a software to do a task that preinstalled software on the OS is not capable of. For this you have to find and install a new software to complete the work. In Linux you can directly install software from the command line using the Advanced Packaging Tool or apt which comes pre-installed with the Linux.</p>\n<p>Before installing the software you have to check if your OS repository have the required software and to do that we use <code>apt-cache</code> command.</p>\n<pre><code class=\"language-bash\">root@User:~$ apt-cache search package\n</code></pre>\n<h2>Adding Softwares and Pacakges</h2>\n<p>After checking that if the software is in the repo, you can use <code>apt-get</code> command followed by install keyword and the name of the software to download and install the software.</p>\n<pre><code class=\"language-bash\">root@User:~$ apt-get install nmap\r\nReading package lists... Done\r\nBuilding dependency tree\r\nReading state information... Done\r\nSuggested packages:\r\nzenmap\r\nThe following NEW packages will be installed:\r\nnmap\r\nInstall these pacakages without verifivation [Y/n]?\r\n# Downloading and Installing nmap\n</code></pre>\n<h2>Updating and Upgrading Software and Packages</h2>\n<p>These software are updated day by day and often contains some changes that are needed to better secure your OS. So you must periodically update your local softwares and to do that just type <code>update</code> infront of the <code>apt-get</code> command.</p>\n<pre><code class=\"language-bash\">root@User:~$ apt-get update\r\n# Updating all necessary Softwares\r\n# and packages\n</code></pre>\n<p>The same goes for Upgrading softwares. The newer versions of the sotware are built contain more features and are better at protecting the OS and the system. To upgrade your software, use <code>upgrade</code> keyword instead of <code>update</code>.</p>\n<pre><code class=\"language-bash\">root@User:~$ apt-get upgrade\r\n# Upgrades all out-of-date\r\n# softwares and pacakges\n</code></pre>\n<h2>Removing Softwares and Packages</h2>\n<p>The same command is alos used to remove softwares and pacakages from the system. Use <code>apt-get</code> followed by <code>remove</code> and the name of the package to remove.</p>\n<pre><code class=\"language-bash\">root@User:~$ apt-get remove nmap\n</code></pre>\n<p>After that it will print some info and ask for permission to remove the software.</p>\n<p>If you want to delete the whole package as well as the configuration files and other settings related files you can use the <code>purge</code> keyword instead of the remove.</p>\n<pre><code class=\"language-bash\">root@User:~$ apt-get purge nmap\n</code></pre>\n","tags":["Linux"]}},"__N_SSG":true}