{"pageProps":{"post":{"title":"Day 91 - Javascript Unit Testing With JEST.js","date":"2021-04-01","slug":"day-91","content":"<p>I tried to do some open-source coding which I have never done before and was looking for a project to contribute to can came upon one which wanted new user to write tests for the code. So I thought this was the right moment to learn about some unit testing in JS.</p>\n<h2>Unit Testing</h2>\n<p>Unit Testing is a method to test the written code to check if it is fit for use and does what it is intended to do. There are two ways to do unit testing, Manual or Automatic.</p>\n<ul>\n<li><strong>Manual.</strong> where programmers or some other person checks the code one by one to check it works correctly.</li>\n<li><strong>Automatic.</strong> where programmers write code that do the testing for them.</li>\n</ul>\n<p>Manual testing is a lot of work and prone to error so mostly we do automaice code based testing.</p>\n<h2>JS Code Testing</h2>\n<p>The project i was trying to contribute to wanted beginners to write test for TypeScript (A Superset of JavaScript), which is same as JS with some extras. To do testing for JS code there is a framework called <strong>JEST.js</strong> which was developed by Facebook to test React code but now can be used to test both forntend and backend JS.</p>\n<h3>JEST.js</h3>\n<p>JEST is a framerwork for JS unit testing by Facebook. It can be used to test both backend and frontend JavaScript code. To use it we first have to install in our project as a DevDependency.</p>\n<pre><code class=\"language-bash\">npm install --dev jest\n</code></pre>\n<p>Add following to scripts in <code>package.json</code> file in the projecst directory.</p>\n<pre><code class=\"language-json\">{\r\n  \"scripts\": {\r\n    \"test\": \"jest\"\r\n  }\r\n}\n</code></pre>\n<p>We then create a file and write some code to test.</p>\n<pre><code class=\"language-js\">// add.js\r\nfunction(a, b) {\r\n    return a + b\r\n}\n</code></pre>\n<p>We then create a file which ends with <code>.test.js</code> instead of <code>.js</code> which lets the jest to pick it up automatically to test.</p>\n<pre><code class=\"language-js\">// add.test.js\r\nconst add = require(\"./add\");\r\n\r\ntest(\"1 + 2 is equal to 3\", () => {\r\n  expect(add(1, 2)).toBe(3);\r\n});\n</code></pre>\n<p>We run the following command in the terminal and it will test it for us and prints the result in the terminal.</p>\n<pre><code class=\"language-bash\">User@Linux>> npm run test\r\n\r\nPASS  ./sum.test.js\r\n✓ adds 1 + 2 to equal 3 (5ms)\n</code></pre>\n<p>This was a simple way to show how JEST works. To learn more about it check out the <a href=\"https://jestjs.io/docs/using-matchers\">Documentaion</a> for complete info about what more JEST can do.</p>\n","tags":["JavaScript","Testing","JS-Libray"]}},"__N_SSG":true}