{"pageProps":{"post":{"title":"Day 33 - Linux Basics And File System","date":"2021-02-02","slug":"day-33","content":"<p>This is the second post in Linux Series and in this post we will discuss about some basics of Linux like File System and some other topics like shell and command-line.</p>\n<p>In case of installation of Linux, for learning purposes it is advised to use VMeare or Virtual Box (what I will be using) and then download one of the distributions of linux like Ubuntu (distro I will be using) or Debian from the Internet and install it.</p>\n<p>Now to the basics. First about Linux File System.</p>\n<h2>Linux File System</h2>\n<p>A File System is a system of managing files like images, text files etc and folders (directories) in an operating system. Linux uses UNIX Filesystem Hierarchy Standard (FHS) for arrarnging directories and files into the filesystem.</p>\n<p>Linux filesystem is different form most of the OS like Windows. It does not uses partition system like C: and D: drives in Windows. At the very top of the filesystem is <code>/</code> which is the root directory like a root of a tree but upside down. The <code>/</code> or root contains all the important subdirectories like <code>/root</code> and <code>/bin</code> etc. following are some most important subdirectories in Linux filesystem.</p>\n<ul>\n<li><strong>/root</strong> - Home directory of the superuser or Admisintrator</li>\n<li><strong>/bin</strong> - Contains all the binaries or executibles, programs that you can run example: ls, cat, pwd etc</li>\n<li><strong>/dev</strong> - Contains device files</li>\n<li><strong>/home</strong> - User's home directory</li>\n<li><strong>/lib</strong> - Contains all libraries of code used by programs</li>\n<li><strong>/mnt</strong> - Where other filesystems are attached like USBs or Hard Drives etc</li>\n<li><strong>/tmp</strong> - Contains temporary files</li>\n<li><strong>/boot</strong> - Contains files required for the system to start</li>\n</ul>\n<h2>Navigating the Linux FileSystem</h2>\n<p>Unlike Windows or MacOS where Graphical User Interface or GUI is used to navigate the filesystem, Linux uses shell also known as command-line or terminal to navigate the filesystem. In terminal, commands are used to perform actions like finding current directory or moving or deleting files etc.</p>\n<p>When you open a terminal or shell or command-line, you will find somthing already written in the terminal like following.</p>\n<pre><code class=\"language-bash\">root@User:~$\n</code></pre>\n<p>This is called a prompt. You write the commands in front of the dollar sign and hit enter and it will perform the action of the command. The <code>~</code> or Tilde sign means you are in the home directory.</p>\n<p>After opening a terminal you have to know in what directory you are in and to find that <code>pwd</code> command is used.</p>\n<pre><code class=\"language-bash\">root@User:~$ pwd\r\n/root\n</code></pre>\n<p>you are in the /root directory if you logged in as the superuser.</p>\n<p>I have already written about command-line and some basic commands to know to work with Linux, So I will not write them again and if you want to, you can read it <a href=\"/day-19/\">Here</a>.</p>\n<p>Some commands that are not discussed in the above mentioned post that are also necessary to know are following.</p>\n<h3>Creating a file</h3>\n<p>Command: touch</p>\n<pre><code class=\"language-bash\">root@User:/$ cd tmp\r\nroot@User:/tmp$ touch new_file.txt\r\nroot@User:/tmp$ ls\r\nnew_file.txt\n</code></pre>\n<h3>Looking for help</h3>\n<p>Command: man</p>\n<p>Typing man with the command as the argument will show the Manual Pages for the command.</p>\n<pre><code class=\"language-bash\">root@User:/$ man clear\r\n\r\nclear(1)        General Commands Manual     clear(1)\r\n\r\nNAME\r\n    clear - clear the terminal screen\r\n\r\nSYNOPSIS\r\n   clear [-Ttype] [-V] [-x]\r\n\r\nDESCRIPTION\r\n    clear clears your screen if this is possible, including\r\n    its scrollback buffer (if the extended “E3” capability\r\n    is defined).  clear looks in the environment for the\r\n    terminal type given by the environment variable TERM,\r\n    and then in the terminfo database to determine how to\r\n    clear the screen.\r\n    ...\r\n    ...\r\n    ...\n</code></pre>\n<p>and Many more I will discuss in the next post.</p>\n","tags":["Linux"]}},"__N_SSG":true}