{"pageProps":{"post":{"title":"Day 129 - Migrating From GatsbyJS To NextJS [1]","date":"2021-05-09","slug":"day-129","content":"<p>Last time I did some makeover of all the files and folders of the GatsbyJS blog in accordance for it to work with the NextJS and changed code and so on and now I will be explaining a little more of what I did and why I did it.</p>\n<h3>NextJS Pages</h3>\n<p>In the last post I moved the <code>pages</code> folder to root dir from the <code>src</code> dir and after that also moved the js files <code>templates</code> dir to pages as well. Why i did this is because NextJS will render all the single files in the pages folder inside the root dir as a page in the browser. What this means that if there is a file named <code>contact.js</code> in the <code>pages</code> dir it will be a page in the browser with the path of <code>/contact/</code>.</p>\n<pre><code class=\"language-md\">index.js => /\r\ncontact.js => /contact/\r\nabout.js => /about/\n</code></pre>\n<p>Any dir inside the pages dir with an another .js file inside it will also be a page with path simillar to the one that is inside the <code>pages</code> dir.</p>\n<pre><code class=\"language-md\">/pages/blog/day01.js => /blog/page01\n</code></pre>\n<h3>Blog Pages With Markdown</h3>\n<p>This part was most trouble for me as I had to make some changes in the current files and also changes in all the markdown files to render the pages differently for all the posts. Currently the markdown files are in the <code>/content/blog</code> directory and I will be using <a href=\"https://github.com/vercel/next.js/blob/canary/examples/blog-starter/lib/api.js\">this</a> way of fetching all markdown files that they use in the <code>blog-starter</code> example they did with NextJS.</p>\n<p>First i tried to fetch as is from the <code>contect/blog</code> dir changing the <code>postsDir</code> variable in the api file but somehow it was not working for me and also i had to deal with the images that I used in the markdown files that were in the same folder as the markdown file.</p>\n<p>So what I did was that moved all the markdown files in the <code>_posts</code> folder and changed the current <code>gray-matter</code> that was like this:</p>\n<pre><code class=\"language-md\">---\r\ntitle: Day 01\r\ndate: \"2021-01-01\"\r\ntags:\r\n  - Tag01\r\n  - Tag02\r\n---\n</code></pre>\n<p>To something like this:</p>\n<pre><code class=\"language-md\">---\r\ntitle: Day 01\r\ndate: \"2021-01-01\"\r\ncover: /assets/images/day01/cover.jpg\r\ntags:\r\n  - Tag01\r\n  - Tag02\r\n---\n</code></pre>\n<p>With this all had to do was to move files here and there instead of rewriting all the code that i copied from <code>NextJS/examples/blog-starter/lib/api.js</code> and also moved all the image files from their markdown folders to the public folder that NextJS uses for static files with <code>Day</code> with number as the parent folder to them.</p>\n<p>Now after all this my root dir looks like this.</p>\n","tags":["GatsbyJS","NextJS","JavaScript"]}},"__N_SSG":true}