{"pageProps":{"post":{"title":"Day 63 - Scheduling and Scheduling Algorithms [0]","date":"2021-03-04","slug":"day-63","content":"<p>Last day I learned about some simple algorihtms that are used in the OS design and today I will be learning about more algorithms that are also used in Operating Systems. These are scheduling algorithms that are mostly used in the Operating System's Scheduler for scheduling tasks.</p>\n<h2>Process Scheduler</h2>\n<p>A Process Scheduler is a part of the operating system that makes the decision for the CPU on what porcess to select form the queue to perform actions on it. The processes are placed in a queue and are selected by the scheduler to take actions on them by the CPU. There are three types of schedulers that work in an operating system but I will not be going in depth about them because this is about algorithms only and these are:</p>\n<ul>\n<li>Long Term Scheduler</li>\n<li>Short Term Scheduler</li>\n<li>Medium Term Scheduler</li>\n</ul>\n<h2>Scheduling Algorithms</h2>\n<p>A scheduler uses algorithms to decide the prioirty of the processes in the queue to feed them to the CPU and these algorithms are called Scheduler algorithms. There are atleast six very commin kinds of scheduler algorithms and I will be doning two of them today and maybe three or four of them tomorrow.</p>\n<ul>\n<li>FCFS Scheduling</li>\n<li>SJF Scheduling</li>\n<li>Priority Scheduling</li>\n<li>Round Robin Scheduling</li>\n<li>MLQ Scheduling</li>\n<li>Multiple Processor Scheduling</li>\n</ul>\n<h3>First Come First Serve (FCFS) Scheduling</h3>\n<p>A scheduling algorithm which is based on First Come First Serve basis. It means the process that enters the queue first will be executed first and so on. It is easy to implement and understand and kind of works the same way as the Data Structure Queue.</p>\n<p>The disadvantages of this algorithm is that it is very much slow than most of the algorithms in the list. and takes a lot of time to process.</p>\n<pre><code class=\"language-js\">----- Before Execution -----\r\n\r\n----- Processes -----\r\n|1|2|3|4|5|6|7|8|9|\r\n\r\nprocessBeingExecuted = 0\r\nnextProcess = 1\r\n\r\n\r\n----- After Execution -----\r\n\r\n----- Processes -----\r\n|2|3|4|5|6|7|8|9|\r\n\r\nprocessBeingExecuted = 1\r\nnextProcess = 2\r\n\n</code></pre>\n<h3>Shortest Job First (SJF) Scheduling</h3>\n<p>Shortest Job First Scheduling algorithm pick the process first that will take the least amount of time to complete. By this way average waiting time is reduced by running the shortest job first. And easy to implement in systems where CPU time id known in advance and impossible to implement in systems where the process time is unknow at first. That is why to make is work fast, process time should be know at the beginnig of the process.</p>\n<pre><code class=\"language-js\">\r\n|  Job  |  Arrival Time  |  Process Time  |\r\n|   0   |  1             |  5             |\r\n|   1   |  0             |  2             |\r\n|   2   |  2             |  1             |\r\n\r\nprocessQueue = [2, 1, 0] // Based on Process Time\r\n\n</code></pre>\n","tags":["Data-Structures","Algorithms"]}},"__N_SSG":true}