{"pageProps":{"post":{"title":"Day 76 - Threading Libraries And Examples","date":"2021-03-17","slug":"day-76","content":"<p>A Threading Library is a piece of code that provides the programmers with APIs to create and manage threads in an Operating Systems. There are two ways to implement a thread library. One is to write a user-level library and the other is kernel-level library.</p>\n<ul>\n<li>\n<p><strong>User-Level Library.</strong> This way a library is provided entirely in user space with no kernel support and all code and data structures exist in user-space. This means that invoking a function will result in only local funciton call in the user space but not a system call.</p>\n</li>\n<li>\n<p><strong>Kernel-Level Library.</strong> This way the library is fully supported by the operating system and data structures and code exist in kernel. Invoking a function call with result in system call directly to the kernel.</p>\n</li>\n</ul>\n<p>Following three are the main threading libraries in majority use.</p>\n<ol>\n<li><strong>POSIX Pthreads.</strong> It may be provided as a user or kernel library as an extension to the POSIX standards.</li>\n<li><strong>Win32 Threads.</strong> It is provided as a kernel library in the Windows system.</li>\n<li><strong>Java Threads.</strong> This library is provided to create and manage threads directly in Java programs and their implementation is depended on the OS on which the JVM (Java Virtual Machine) is running.</li>\n</ol>\n<h2>Examples In Operating Systems</h2>\n<p>Following are the examples of threads in use in Operating Systems.</p>\n<h3>Windows Operating System</h3>\n<p>Win32 library supports one-to-one threading model but also provides a library to implement many-to-many model. A windows OS run an application as a single process and every process can have one or more threads in it. Every thread in windows has following components.</p>\n<ul>\n<li>A Thread ID</li>\n<li>Registers</li>\n<li>A user-stack in user mode</li>\n<li>A kernel-stack in kernel mode</li>\n<li>A private storage area used by run-time libraries and dynamic-link libraries.</li>\n</ul>\n<p>The key data structures for windows threads are ETHREAD (Executive Thread Block), KTHREAD (Kernel Thread Block), and TEB (Thread Environment Block). ETHREAD and KTHREAD can only be accessed by the kernel while TEB can be accessed by the user.</p>\n<h3>Linux Operating Systems</h3>\n<p>Linux doesn't distinguish between processes and threads. It uses the more generic term tasks for representing processes and threads. Linux provides the <strong>fork()</strong> system call that completely duplicates a process task. a separate system call called <strong>clone()</strong> is also provided to create threads. These are controlled by different flags.</p>\n","tags":["Operating-Systems"]}},"__N_SSG":true}