{"pageProps":{"post":{"title":"Day 32 - What is Linux?","date":"2021-02-01","slug":"day-32","content":"<p>This is the first post in the Linux Series that I will be doing this month. I will try to learn all about Linux from scratch and everything that a developer needs in a month. But first about some history on Linux and explaining what is Linux?</p>\n<h2>What is Linux?</h2>\n<p>Linux is an Open Source Operating System just like Windows and macOS. Linux is a Unix-like OS based on Linux Kernal that was developed by Linux Torvalds and first released in 1991.</p>\n<p>A Kernal is a most important part of an OS. It is a computer program that is the core of the operating system and has full control over everything in the system. it is the first program that is loaded in to the memory and remains in the memory until the system is shutdown. It controls all the major functions of the hardware.</p>\n<p>Linux kernal was developed by Linus Torvalds in 1991 for his i386 based PC and was later open-sourced. As mentioned before that it is a Unix-like OS, its name also comes from the name of the creater, Linus and the popular operating system at that time, Unix.</p>\n<h2>Linux Distributions</h2>\n<p>Because Linux is OpenSource, many organizations and developers have modified and used it in many of thier own purposes. Many of them open-sourced them into complete packages and also many of them made commercially available with many features that may not be included in free packages. These packages are called Linux Distributions.</p>\n<p>Popular free distributions include Debian, Fedora, Ubuntu and CentOS. and commercially RedHat Enterprise Linux etc.</p>\n<h2>Uses of Linux</h2>\n<p>Linux is the powerhouse of most of the internet today. Almost 90% of all cloud infrastructure is powered by Linux and more than 70% of all the smartphones are being powered by Android which is based on Linux.</p>\n<p>NASA and many large organizations use Linux in their Systems and almost all supercomputers in the world are running Linux.</p>\n<h2>Why Linux is better than MacOS and Windows</h2>\n<ol>\n<li>It is open-sourced.</li>\n<li>It can be installed on an PC and MAC.</li>\n<li>Real time application updating.</li>\n<li>Much better security.</li>\n<li>Customization and Flexibility.</li>\n<li>More control to the user.</li>\n</ol>\n<p>And there are many other features of Linux that make it better than most of the Operating Systems in the market but most importantly you can get it for <strong>free</strong>.</p>\n<p>In next posts I will write about the basics of the Linux OS and how it works under the hood etc.</p>\n","tags":["Linux"]}},"__N_SSG":true}