{"pageProps":{"post":{"title":"Day 117 - Functions In Rust","date":"2021-04-27","slug":"day-117","content":"<p>Last time we looked at Variables, Comments and some of the Types in Rust and now its time for funtions in Rust. A function is a piece of code that peforms a task. It can be reused as many times as you want. You can provide some data to it and it can return some data to you.</p>\n<h2>Functions In Rust</h2>\n<p>To define a function in Rust, we use <code>fn</code> keyword followed by the function name and paranthesis <code>()</code> and then curly braces <code>{}</code> after that. These <code>{}</code> hold your function code that executes when your function is called.</p>\n<pre><code class=\"language-rs\">fn print_a_line() {\r\n    println!(\"This is a String!\");\r\n}\n</code></pre>\n<h3>Function Parameters</h3>\n<p>We can provide the function with parameters in the parathesis. We have to tell the compiler outself what the pratmeter type will be. First we write the parameter name and then after that a colon <code>:</code> and then we specify a type for the parameter.</p>\n<pre><code class=\"language-rs\">fn print_a_line(line: &#x26;str) {\r\n    println!()\r\n}\n</code></pre>\n<h3>Function Return Type</h3>\n<p>We can also tell the compiler in advance what type of value does the function return will be. We can do so by adding an arrow <code>-></code> after the paranthesis and then specifying the type.</p>\n<pre><code class=\"language-rs\">fn add(a: i32, b: i32) -> i32 {\r\n  a + b\r\n}\n</code></pre>\n<p>Here you see we have a function with two parameters both of which are 32-bit integers and the return type for the function is also a 32-bit integer. Down there we then add two numbers.</p>\n<p>But in the above code you may some thing that is may be new to you (it is for me) and that is that we are not using any return keyword here. Functions in Rust will by default return the value of the last line in the function which does not have a semi-colon in the end.</p>\n<pre><code class=\"language-rs\">fn add(a: i32, b: i32) -> i32 {\r\n  return a + b;\r\n}\r\n\r\n// This function is the same as the above\r\nfn add(a: i32, b: i32) -> i32 {\r\n  a + b\r\n}\n</code></pre>\n<p>But if you add <code>return</code> keyword before something you also have to add a semi-colon at the end too.</p>\n<p>That it for the functions of Rust and next we will be covering Loops and Conditionals in Rust and after that we will be taking a look at Owndership which is a new concept to me and is also a unique feature in Rust Programming Language. See you all next time.</p>\n","tags":["Rust","Programming-Language"]}},"__N_SSG":true}