{"pageProps":{"post":{"title":"Day 31 - Sunday, Januray 31, 2021","date":"2021-01-31","slug":"day-31","content":"<p><img src=\"/assets/images/day-31/internet.jpg\" alt=\"Globe\"></p>\n<p>This might be the last post in the Networking Series. And this will be all about Internet. What it is? How it works? and Who own/controls it?</p>\n<h2>What is Internet?</h2>\n<p>In simple words, Internet is a huge <a href=\"/day-24/\">Network</a> of Networks of Computers and other devices that are sharing data with each other. The word Internet comes from the concept of <strong>Inter</strong>connected <strong>Net</strong>works. Billions of devices on the globe are connected with each other and can share information in the blink of an eye which is a feat that a century earlier was not even thought to be possible to achieve. Computers connected with each other share data through wires, cables, radio waves and through other mediums.</p>\n<p>The Internet is probably the most powerful tool humanity has ever built.</p>\n<h2>How does the Internet works?</h2>\n<p>Computers share data in the form of bits and bytes. All data sent over the cables and other physical mediums is sent in the form of electrical signals or light pulses. These signals and pulses are bits of data that the receiver's device interprets it to a useful form of data. Bits are simply ones and zeros represented by the electric signals being on and off where On is interpreted as 1 and Off as 0.</p>\n<p>Computers need a medium link either physical (Ethernet) or wireless (Wi-Fi) to communicate with each other and form a network. Computers also form a network through connecting with a network <a href=\"/day-25/\"><strong>switch</strong></a> or <strong>hubs</strong>. The switches are connected with <a href=\"/day-25/\"><strong>routers</strong></a> to form a bigger and wider network.</p>\n<p>A Router manages the packets coming from or going to devices that are not connected on the same local network. A packet is a smaller piece of a larger message. A packet contains the data and the information about the data.</p>\n<p>Information and data is shared over the internet by following some standards and rules that are either recognized by a well known organization or are widely addopted by the industry. In Networking these are called Networking or Communication Protocols.</p>\n<p>Some common protocols that are used for sending and receiving data on the internet are:</p>\n<ul>\n<li><a href=\"/day-27/\">TCP</a> (Transmission Control Protocol) - For managing connection between the sender and receiver.</li>\n<li><a href=\"/day-27/\">IP</a> (Internet Protocol) - For routing and addressing of packets of data between devices on the internet.</li>\n<li>HTTP (Hyper Text Transfer Protocol) - For Hypertext documents like HTML documents.</li>\n<li>SMTP (Simple Mail Transfer Protocol) - For Email Services.</li>\n</ul>\n<h2>Who owns the Internet?</h2>\n<p>Internet is not owned by or controlled by any one person or organization. It is not controlled by the governments or ISPs. The internet is maintained by hundereds of organizations, businesses and non-profits that make the internet the place of sharing information for anyone and everyone.</p>\n<p>For example ICANN (Internet Corporation of Assigned Names and Numbers) is a non-profit that is responsible for coordinating the maintenance of databases that are related to the namespaces and numerical spaces of the Internet, ensuring the Internet's stable and secure operation. and W3C (World Wide Web Consortium) which is an organization which is led by the father of the modern Web, Tim Berners-Lee, works on the development of standards for the World Wide Web.</p>\n<p>This was a brief introduction to the Internet and how it works and who owns it.</p>\n<blockquote>\n<p>Note: This blog post is incomplete and will be updated time by time.</p>\n</blockquote>\n","tags":["Networking"]}},"__N_SSG":true}