{"pageProps":{"post":{"title":"Day 121 Enums In Rust","date":"2021-05-01","slug":"day-121","content":"<p>Now we know all the basics of Rust Programming Language like Control Flow Statements, Variables, Comments and Functions etc. Now we will be taking a look at intermediate concepts of Rust Programming Language. Things like Enums, Structs and Traits etc. For today we will try to understand what Enums are.</p>\n<h3>Enums</h3>\n<p>Enumerations or simply Enums allow us to define our own custom types. These data types consists of predefined named values called elements or members etc. To create an Enum in Rust we use the following syntax.</p>\n<pre><code class=\"language-rs\">fn main() {\r\n  // Creating an enum\r\n  enum Name {\r\n    Member01,\r\n    Member02,\r\n    // ...\r\n    MemberN\r\n  }\r\n}\n</code></pre>\n<p>We use the <code>enum</code> keywork followed by the name of the enum and then curly braces and inside those curly braces comes the values or members.</p>\n<p>Now lets create an enum named <code>Fruits</code> and see where can it be helpful.</p>\n<pre><code class=\"language-rs\">fn main() {\r\n  enum Fruit {\r\n    Apple,\r\n    Orange,\r\n    Kiwi\r\n  }\r\n}\n</code></pre>\n<p>To reference an enum value we use double colon after the enum name and then the name of the value.</p>\n<pre><code class=\"language-rs\">let apple = Fruit::Apple;\n</code></pre>\n<p>Members of the enums also have a value inside the enum. For example startig from zero the Kiwi fruit will have a value of 2.</p>\n<pre><code class=\"language-rs\">println!(\"{}\", Fruit::Kiwi as i32); // 2\n</code></pre>\n<p>But we can also define values to the elements of enums like so.</p>\n<pre><code class=\"language-rs\">enum Company {\r\n  Apple = \"APL\",\r\n  Tesla = \"TSLA\"\r\n}\n</code></pre>\n<p>This is all about Enums for now. This might be a simple thing for some but I still don't know where this thing could be useful in programming. Ofcourse this is useful in programming that is why it is there. But maybe I will come across something that will let me know the importance of enums in programming but for now lets just leave it like this.</p>\n","tags":["Rust","Programming-Language"]}},"__N_SSG":true}