{"pageProps":{"post":{"title":"Day 25 - Monday, Januray 25, 2021","date":"2021-01-25","slug":"day-25","content":"<p><img src=\"/assets/images/day-25/router.jpg\" alt=\"Router\"></p>\n<p>This is the second post in the Networking Series. Last post was about what is a Computer Network? and this post will cover about Networking Devices like Switches and Routers etc.</p>\n<h2>Networking Devices</h2>\n<p>Networking Devices are devices that are required for the communication and transmission of data between other devices like computers over a computer network. These devices are generally classified by the location they are being used and the network in which they are used.</p>\n<p>There are many kinds of Networking devices but I will just write about three of them,Bridges, Routers and Switches</p>\n<h3>What is a Bridge?</h3>\n<p>A Bridge is a device that connects multiple network segments which are small portions of a computer network. A Bridge works on OSI Layer 1 and 2. I will write about OSI Layers in the future.\r\nWhat a Bridge basically does is it connects multiple small networks to form a single network.</p>\n<h3>What is a Switch?</h3>\n<p>A Switch is a device that connects devices on a network. A Switch uses packet switching to send, receive and process data from a source device to the destination device. A Switch works on OSI Layer 2.\r\nA Switch is a smart device unlike a Hub. A Hub sends the packet to all the user that are connected to it but a Switch only transmits the packet to only the user it was intented to creating a kind of layer of security.</p>\n<h3>What are Routers?</h3>\n<p>A Router is a device that forwards data packet between computer networks. Most routers connect through cables to other devices. Routers perform as a traffic directing device that directs the traffic coming from the internet to a destination device.\r\nRouters are connected to two or more devices and when they receive data packet from one device connected to it, they read the header of the packet and then determine from the header the address of the detination device to transmit the data packet to it. Routers work on OSI Layer 3.</p>\n<p>That is all for today, I will try to write more from tomorrow and will explain more in detail about the topic that I choose for the day.</p>\n","tags":["Networking"]}},"__N_SSG":true}