{"pageProps":{"post":{"title":"Day 37 - Users and Permissions in Linux","date":"2021-02-06","slug":"day-37","content":"<p>This is the sixth post in the Linux series and it will be about Users and Permissions in Linux. But first of all what are users and permissions in Linux?</p>\n<h2>What are Users in Linux?</h2>\n<p>Linux OS provides the ability of multitasking and management of task by more than one user at a time. It was designed to work with multiple users working at the same System at the same time. Other OS like Windows does not allows more than one user to work at the same time. So in order to make it work properly and for security reasons Users are created in the Linux with limited privillages to perform multitasking.</p>\n<p>Each user has a set of permissions. What things that they can access in the system is defined in the permissions that are allowed to them by the admin/root user. An admin user has all the access permissions on the system and they can do anything they want with the system like deleting everything in the system. So for security purposes it is necessary to create users with limited access that they need to perform the work that is required of them and not access anything else.</p>\n<p>Many System Admins create a user for themselves with limited permissions to not accidently damage any file that require root access. Now to permissions.</p>\n<h2>What are permissions?</h2>\n<p>Permissions or access rights are measures that control the ability of the user to create, modify, execute or navigate the file/directories in the file system. Basic permissions are follwoing.</p>\n<ul>\n<li>Create - the permission for a user to create files.</li>\n<li>Modify - the permission for a user to make a change or delete a file.</li>\n<li>Execute - the permission to execute any files they want.</li>\n<li>Navigate - the permission to naveigate to any directory of choice and views contents in them.</li>\n</ul>\n<h3>Creaing User in Linux</h3>\n<p>To create a new user in Linux <code>useradd</code> command is used. Type <code>useradd</code> followed by the name of the user and hit enter and it will create the user.</p>\n<pre><code class=\"language-bash\">root@User:/$ useradd new-user\n</code></pre>\n<p>All the users that are created or were created by the system are stored in <code>/etc/passwd</code>. Now run the <code>cat</code> command with <code>/etc/passwd</code> and it will print out all the users with the newly created user at the last.</p>\n<pre><code class=\"language-bash\">root@User:/$ cat /etc/passwd\r\nroot:x:0:0:root:/root:/bin/bash\r\ndaemon:x:1:1:daemon:/usr/sbin:/usr/sbin/nologin\r\n...\r\n...\r\n...\r\nnew-user:x:1000:1000::/home/new-user:/bin/sh\n</code></pre>\n<p>You may need root access if you are not logged in as the admin to create a user. <code>useradd</code> command also accepts some options to add to the new user like adding expiry date for the user of creating home directory for the user to login to.</p>\n<p>There is also another command that is easier for people that are new to Linux to create users. It is <code>adduser</code> command. It create the defualt home dir for other necessary things for a new user that you have to do manually when creating a user with <code>useradd</code> command. It works same as the first command.</p>\n<pre><code class=\"language-bash\">root@User:/$ adduser another-new-user\r\nAdding user `another-new-user' ...\r\nAdding new group `another-new-user' (1001) ...\r\nAdding new user `another-new-user' (1001) with group `another-new-user' ...\r\nCreating home directory `/home/another-new-user' ...\r\nCopying files from `/etc/skel' ...\r\nNew password:\r\nRetype new password:\r\npasswd: password updated successfully\r\nChanging the user information for another-new-user\r\nEnter the new value, or press ENTER for the default\r\n        Full Name []: New User\r\n        Room Number []: New User Room Number\r\n        Work Phone []: New User Work Number\r\n        Home Phone []: New User Phone Number\r\n        Other []: Others\r\nIs the information correct? [Y/n] Y\n</code></pre>\n<p>You see that it will ask some questions about the newly created user and assigns it to a new group by itself. All these things you have to do manually if created with <code>useradd</code> command.</p>\n<h3>Deleting a User</h3>\n<p>To delete a user first you need to have admin access and them type <code>deluser</code> command with users name as the arugment.</p>\n<pre><code class=\"language-bash\">root@User:/$ deluser new-user\n</code></pre>\n<h3>Setting password for the newuser</h3>\n<p>To setup a password for the newuser type <code>passwd</code> command with users name as the argument and hit enter and it will ask you for the password. When typing password it will not show how many words are typed as they do in the browser and so be careful when typing the password.</p>\n<pre><code class=\"language-bash\">root@User:/$ passwd new-user\r\nNew password:\r\nRetype new password:\r\npasswd: password updated successfully\r\nroot@User:/$\n</code></pre>\n<p>Thats it for today and next will be about groups and adding permissions to the users and assigning users to the group.</p>\n","tags":["Linux"]}},"__N_SSG":true}