{"pageProps":{"post":{"title":"Day 46 - Scheduling Tasks In Linux","date":"2021-02-15","slug":"day-46","content":"<p>This is the 15th post in the Linux Series and this will about Scheduling Processes in a Linux System. Anyone learning Linux must know how to schedule processes in the Linux as it can be very useful once you start getting better at it and want to schedule processes like backing-up certain files and running a certain process at a certain time etc. There are two ways that I know to schedule processes in Linux, one is <code>at</code> and the other is <code>cron</code>.</p>\n<h2>Scheduling Process To Run Only Once</h2>\n<p>The <code>at</code> command is used to run some process at a certain time in the future for only once. <code>at</code> command is a daemon which a background process used to schedule a process.</p>\n<p>The <code>at</code> command accepts an argument as a time stamp and then asks for a file or processs to run at that time.</p>\n<pre><code class=\"language-bash\">root@User:~$ at 7:00am\r\nat>/home/User/script-to-run\n</code></pre>\n<p>The <code>at</code> command accepts following time formats to schedule tasks.</p>\n<p>| Format                | Meaning                                    |\r\n| --------------------- | ------------------------------------------ |\r\n| at noon               | Runs at noon on the current day            |\r\n| at tomorrow           | Runs tomorrow from current day             |\r\n| at now + n minutes    | Runs after n minutes from the current time |\r\n| at now + n hours      | Runs after n hours from the current time   |\r\n| at now + n days       | Runs after n day from the current time     |\r\n| at now + n weeks      | Runs after n weeks from the current time   |\r\n| at 10:00am            | Runs at 10:00 AM of the current day        |\r\n| at 10:00pm            | Runs at 10:00 PM of the current day        |\r\n| at 10:00pm May 15     | Runs at 10 PM on May 25                    |\r\n| at 10:00pm 05/15/2021 | Runs at 10 PM on May 25                    |</p>\n<h2>Scheduling Process To Run Regularly</h2>\n<p>The <code>cron</code> daemon (Daemon: a process that runs in the background) is used to schedule task to run on regular basis on a specified time. The <code>cron</code> and <code>crontab</code> are used to manage these tasks.</p>\n<p>To shcedule a task using <code>cron</code> you need to edit the <code>crontab</code> (cron table) file with adding or removing the task you want to schedule to run after the time that you specify in the file. The <code>crontab</code> accepts the following syntax.</p>\n<pre><code class=\"language-bash\">M   H   DOM   MON   DOW   USER   COMMAND\r\n*   *   *     *     *     User   /lib/command\n</code></pre>\n<p>The five stars are for Minute, Hour, DayOfMonth, MONth, DayOfWeek respectively. You specify Minutes, Hours, DayOfMonth, MONth, DayOfWeek in the place of the stars (asterisks) after which the task should run. The Units to use in place of asterisks are following.</p>\n<p>| Unit                   | Limit                 |\r\n| ---------------------- | --------------------- |\r\n| Minute (M)             | After 0 to 59 Minutes |\r\n| Hour (H)               | After 0 to 23 Hours   |\r\n| Day Of the Month (DOM) | After 1 to 31 Days    |\r\n| Month (MON)            | After 1 to 12         |\r\n| Day Of the Week        | After 0 to 7 Days     |</p>\n<p>Note: 0 and 7 for DOW both means sunday.</p>\n<p>For Example: I want to backup a file after everyday at 10:00AM from monday to friday as a root user I will edit the <code>crontab</code> file like following.</p>\n<pre><code class=\"language-bash\">root@User:~$ crontab -e\r\n# After selecting the editor to edit the crontab file\r\n--- FILE STARTING ---\r\n# m h dom mon dow user command\r\n0 10 * * 1-5 root /home/user/backup-script\n</code></pre>\n<p>The 0 and 10 means at 10:00AM, two askterisks next means run them no matter what day of the month or what month it is, 1-5 means first five days of the week from monday to firday as a root user run a script with path /home/user/backup-script.</p>\n<p>You can add as many task to schedule in the <code>crontab</code> as you want by adding one line after another in the <code>crontab</code> for one task.</p>\n","tags":["Linux"]}},"__N_SSG":true}