{"pageProps":{"post":{"title":"Day 50 - Resources For Learning Linux","date":"2021-02-19","slug":"day-50","content":"<p>This is the last post in the Linux Series that I started on Februrary 01, 2021 to learn most of the basics of the Linux OS. This will be a small post in which I will share some of the resources that I used to learn about Linux and tools.</p>\n<p>So here are the resources that I used to learn about all the things that I wrote in the last 18 posts on this blog.</p>\n<ul>\n<li><a href=\"https://nostarch.com/linuxbasicsforhackers\">Linux Basics for Hackers (BOOK)</a> - This is the book that I mostly followed throughout the series to learn about the basics of Linux and also about some tools and techniques that are used in IT.</li>\n<li><a href=\"https://www.youtube.com/playlist?list=PLzMcBGfZo4-nUIIMsz040W_X-03QH5c5h\">Linux for Programmers</a> by Tech With Tim - This is a youtube playlist that by Tech With Tim that was released recently and also came to suggested videos on my Youtube Home.</li>\n<li><a href=\"https://youtu.be/navuBR4aJSs\">Introduction to Linux</a> by LiveOverflow - This video explains a little about Linux and how to use it on Windows or other systems using A Virtual Machine.</li>\n<li><a href=\"https://youtu.be/l9YxTXDiiFY\">EVERYONE needs to learn LINUX</a> by NetworkChuck - Learning Linux with Raspberry PI.</li>\n<li><a href=\"https://ubuntu.com/tutorials/command-line-for-beginners#1-overview\">The Linux command line for beginners</a> - Introduction to Linux Command Line by Ubuntu Linux Distro, the one I was using in the series and right now.</li>\n<li><a href=\"https://www.lifewire.com/beginners-guide-to-linux-4090233\">A Beginners Guide to Linux</a></li>\n<li><a href=\"https://www.linux.com/training-tutorials/linux-filesystem-explained/\">The Linux Filesystem Explained</a> - Explaining Linux Directories and what are they for.</li>\n<li><a href=\"https://youtu.be/bXIHEIUSXvY\">Linux and macOS Command Line Basics</a></li>\n<li><a href=\"https://www.lifewire.com/linux-commands-for-navigating-file-system-4027320\">10 Essential Linux Commands for Navigating Your File System</a></li>\n<li><a href=\"https://youtu.be/NTfOnGZUZDk\">Where GREP Came From</a> by Computerphile - Prof. Brian Kernighan explaning the history of <code>grep</code>.</li>\n<li><a href=\"https://youtu.be/Zuwa8zlfXSY\">8 super heroic Linux commands that you probably aren't using</a> - Some more usefull commands by EngineerMan.</li>\n<li><a href=\"https://wiki.archlinux.org/index.php/File_permissions_and_attributes\">File permissions and attributes</a></li>\n<li><a href=\"https://youtu.be/4t4kBkMsDbQ\">Nmap Tutorial to find Network Vulnerabilities</a> by NetworkChuck - This and also the book that I used for Nmap.</li>\n<li><a href=\"https://youtu.be/sXQxhojSdZM\">Regular Expressions (RegEx) in 100 Seconds</a> by Jeff Delaney.</li>\n<li><a href=\"https://youtu.be/528Jc3q86F8\">Regular Expressions</a> by Computerphile - Professor Brailsford explaining how Regex works.</li>\n<li><a href=\"https://youtu.be/bgBWp9EIlMM\">Regular Expressions - Enough to be Dangerous</a> by EngineerMan.</li>\n<li><a href=\"https://youtu.be/sa-TUpSx1JA\">Regular Expressions (Regex) Tutorial</a> by Corey Schafer.</li>\n<li><a href=\"https://wiki.archlinux.org/index.php/Cron\">Cron and Crontab</a> - For scheduling tasks on Linux.</li>\n<li><a href=\"https://youtu.be/v-F3YLd6oMw\">Shell Scripting Crash Course - Beginner Level</a> - Intro to BASH Scripting in Linux.</li>\n<li><a href=\"https://youtu.be/qsA8zREbt6g\">Hide yourself with Kali Linux and ProxyChains</a> - Learning about proxychains to use a proxy server.</li>\n</ul>\n<p>These are almost all the resources that I used during learning Linux OS and other things. If there are some left that I forgot to mention I will add them later in this post.</p>\n","tags":["Linux"]}},"__N_SSG":true}