{"pageProps":{"post":{"title":"Day 130 - Migrating From GatsbyJS To NextJS [2]","date":"2021-05-10","slug":"day-130","content":"<p>Third day of trying to migrate this blog from GatsbyJS to NextJS and most of the work is done all that is remaining is just styling it all from top to bottom.</p>\n<p>Previously when I started this blog with GatsbyJS. GatsbyJS starte-blog template came with styling and variables in the styling. So I didn't did much of the customization and just went with the scss files that were in the projects dir.</p>\n<p>Later I changed my mind and did a little bit of customization to make this blog look more like Harvard Law Review Website. It is a well built website and contains almost no images. It was text only. So I tried to copy the style to make it look more the HLR but also not like it.</p>\n<p>As I am bad with designing things so took inspiration from other well built and popular webistes. First I looked at Medium.com. It is a blogging website and had a good desing and also alot more easily readable. So again i copied some design for my blog post page styling to make it more readable and simple.</p>\n<p>And this went on and on and I made simple and little styling edits whenever I found one.</p>\n<p>Now after I made my <a href=\"zainsci.github.io\">portfolio website</a> and the design was very pleasing to me and also it was built with NextJS, So I decided to migrate this blog from GatsbyJS to NextJS and also redo all the styling from scratch to make it look more like the portfolio website and also add Dark Theme to it.</p>\n<p>For Dark Theme in Portfolio Website I used Colors from GtiHub's Primer CSS repo But to implement Dark Theme in this blog I used fireship.io's public repo as an example. Both of these are implementd the same way with css variable but with slight differences.</p>\n<p>So that's it for today as I am still busy making some changes to the blog and will write next time.</p>\n","tags":["GatsbyJS","NextJS","JavaScript"]}},"__N_SSG":true}