{"pageProps":{"post":{"title":"Day 41 - Some More Useful Commands","date":"2021-02-10","slug":"day-41","content":"<p>This is the 10th post in the Linux Series and may be the last if I didn't found anymore basic topics to learn that are specific to Linux and this post will be about some more Linux commands which can be useful if you want to be better at Linux.</p>\n<h2>Run Multiple Commands at Once</h2>\n<p>This can be very helpful if you want to run more than one command at once but dont want to wait for one command to finish and type the next command so you can just type all the commands and run them all one by one.</p>\n<p>Press Ctrl (Control) Button and while pressing it also press X then E button to open an editor. Type commands in this editor press <code>Ctrl+X</code> enter <code>Y</code> and hit enter button twice and it will run all the commands in the file one by one.</p>\n<pre><code class=\"language-bash\">root@User:~$ Ctrl+x+e\r\nGNU nano 2.9            /tmp/bash-fc.zcF\r\necho \"Hello From Command One\"\r\necho \"Hello From Command Two\"\r\necho \"Hello From Command Three\"\r\necho \"Hello From Command Four\"\r\n# These are all the commands that\r\n# will run after I close the Editor\r\n# by pressing Ctrl+X and type Y and hit\r\n# Enter or Return button twice\r\n\r\nroot@User:~$\r\necho \"Hello From Command One\"\r\nHello From Command One\r\necho \"Hello From Command Two\"\r\nHello From Command Two\r\necho \"Hello From Command Three\"\r\nHello From Command Three\r\necho \"Hello From Command Four\"\r\nHello From Command Four\r\nroot@User:~$\n</code></pre>\n<h2>Editing The Last Command</h2>\n<p>This command is simillar to the last commadn as it will aslo open an editor to write the command but this is used if you wrote a lenghty command and something in it was wrong and you have to change something in it.</p>\n<p>To use it type <code>fc</code> after the the command you want to edit and it will open an editor which will let you chage it the way you want.</p>\n<h2>Navigating A File</h2>\n<p>Seeing the contents of a file to read it can be done with cat command but it will print out all the lines in the file which can be hard to navigate in the terminal so for this most the devs use <code>less</code> command. <code>less</code> command with the file name in front of it will open a file navigator which will help you read the file while scrolling up and down with the arrow keys.</p>\n<h2>Checking History Of Used Commands</h2>\n<p>To check what commands have been used in the current session of the terminal just type <code>history</code> command and it will print out the previous commands from the session.</p>\n<pre><code class=\"language-bash\">root@User:~$ echo \"One\"\r\nOne\r\nroot@User:~$ touch file.txt\r\nroot@User:~$ history\r\necho \"One\"\r\ntouch file.txt\n</code></pre>\n<h2>Avoid Getting A Command In History</h2>\n<p>To avoid getting a command getting recorded in the terminal session history, Add a single space before typing the command.</p>\n<pre><code class=\"language-bash\">root@User:~$ echo \"One\"\r\nOne\r\nroot@User:~$ touch file.txt\r\nroot@User:~$ history\r\necho \"One\"\r\ntouch file.txt\r\nroot@User:~$  echo \"Hidden\"\r\nHidden\r\nroot@User:~$ history\r\necho \"One\"\r\ntouch file.txt\n</code></pre>\n<h2>Making Multiple Directories</h2>\n<p>To make multiple directories with a single command just type the already know <code>mkdir</code> command with number of folders from starting number to finish number separated by two dots inside curly braces just like the following and it will create that many folders.</p>\n<pre><code class=\"language-bash\">root@User:/tmp/temp$ mkdir {1..10}\r\nroot@User:/tmp/temp$ ls\r\n1   10  2   3   4   5   6   7   8   9\n</code></pre>\n<h2>Shutting Down System</h2>\n<p>This one may not seem useful at first because you can just click a button and it will shutdown your system but when you are getting used to a keyboard, going from keyboard to the mouse to click seems more difficult than just typing shutdown.</p>\n","tags":["Linux","Networking"]}},"__N_SSG":true}