{"pageProps":{"post":{"title":"Day 140 - Redux Data Flow","date":"2021-05-20","slug":"day-140","content":"<p>We now know some of the basics of Redux and know how to use Redux in our application and now its time to look at the Redux Data Flow and how Redux handles data.</p>\n<h2>One-Way Data Flow</h2>\n<p>Redux works on the One-Way Data Flow principle. One-Way Data Flow principle means is a cycle of data being updated and UI being updating on that data and so on. The sequence of steps of one-way data flow is following.</p>\n<ul>\n<li>An app have a state which describes it condition at one point.</li>\n<li>The UI is rendered based on that state.</li>\n<li>The state is updated when some event happens like a user clicks a button.</li>\n<li>The UI is again rendered with the updated state.</li>\n</ul>\n<p>Reudx manages state simillarly likes this. Its a one-way data flow. Now we look at Redux and how it does this data flow.</p>\n<h2>Redux Data Flow</h2>\n<p>Initially Redux have a store that we define using the <code>createStore</code> function with a reducer functionas the argument to the createStore function. The store calls the root reducer once to save the initial state of the store the return value of the root reducer. And the UI is rendred at first with that initial state.</p>\n<p>Now this is how a data flows in the Redux application.</p>\n<ul>\n<li>Some change happens in the application like adding a new todo item.</li>\n<li>An action is dispatched from the application.</li>\n<li>The store runs the reducer function with the action telling the reducer what value to update.</li>\n<li>The store updates the state.</li>\n<li>The store notifies all parts of the UI that the state has been updated.</li>\n<li>The UI is rerendered according to the new state.</li>\n</ul>\n<p>Here's how it looks visually.</p>\n<div style=\"display: flex; flex-direction: column; align-items: center;\">\n<p><img src=\"https://redux.js.org/assets/images/ReduxDataFlowDiagram-49fa8c3968371d9ef6f2a1486bd40a26.gif\" alt=\"Redux State Management\"></p>\n</div>\n<div style=\"font-size: 10px; text-align: center;\">\n<p>Image Source: <a href=\"https://redux.js.org/tutorials/fundamentals/part-2-concepts-data-flow#redux-application-data-flow\">ReduxJs.org</a></p>\n</div>\n<p>This is all I think I will learn about the Redux for now. To learn more about the Redux, Check out the <a href=\"https://redux.js.org/tutorials/index\">Official Documentation</a> of Redux. It is explained very well in the docs and I also used Docs for these posts as well.</p>\n","tags":["Redux","JavaScript","React"]}},"__N_SSG":true}