{"pageProps":{"post":{"title":"Day 127 - Rust Final Words","date":"2021-05-07","slug":"day-127","content":"<p>I have been learning Rust Programming Language since last week or so and I think I have learned most of the things that I should be knowing for know about the programming language.</p>\n<p>First of all two weeks ago I didn't thought of learning any new programming language at all but studying about Operating Systems was making me mad. And i wanted to stay away from that for a while a do some light study. And so that's when while scrolling through Youtube I found this video on <a href=\"https://www.youtube.com/watch?v=AzLqTgC0E0s\">Programming Language Tier List</a> by the Youtuber <a href=\"https://www.youtube.com/c/EngineerMan\">EngineerMan</a>. And also found out that he also have a playlist on Rust Programming Language.</p>\n<p>His videos are excellent and always to the point. and that where I learned about the basics of the Rust.</p>\n<p>Also aside from the videos I also looked at the <a href=\"https://doc.rust-lang.org/stable/book/\">Official Documentation Book</a> which was very helpful for me and also this was first time for me that I read a book on some programming language.</p>\n<p>I did learned some new things while learning about Rust like Generics and Enums etc. I learned about Generics when working with React and TypeScript but the concept just went over my head and the same can be said about enums as well.</p>\n<p>Rust seems to have a bright future and as it is as fast as other low level languages like C and C++ it can even be used to write operating systems and if I became good in understanding OS after I go through the remaining parts of it, I am thinking (hoping) of writing a little OS with Rust instead of C. Some people have already done that and they will be of good help to me when I decide to do the same thing myself.</p>\n<p>But for now lets just leave Rust for a while because right now I am thinking and trying to migrate this blog from GatsbyJS to NextJS and also Rust is a little hard to write and work with than most of the languages that I have worked before.\r\nBut who knows, maybe it will be beneficial for me in the future and maybe not. Only Time will Tell.</p>\n","tags":["Rust","Programming-Language"]}},"__N_SSG":true}