{"pageProps":{"post":{"title":"Day 147 - Creating A Design System • Typography","date":"2021-05-27","slug":"day-147","content":"<p>This is the second post about creating a Design System for my project. Last time I selected colors for my project and made 8 variants of those colors in SCSS. Today I will be going through the Typography part of the Design System. We have to look for following things when setting up our typography design.</p>\n<ul>\n<li>Fonts to use</li>\n<li>Type Size &#x26; Scale</li>\n<li>Responsiveness</li>\n<li>And spacing</li>\n</ul>\n<p>This part is all about picking Fonts and setting sizes and weight of those fonts in various place of use for better readability and style. So the first part in this section is picking the fonts for your project.</p>\n<h2>Picking Fonts</h2>\n<p>This might be the hardest part of the Typography section as there are thousands of fonts out there are if you are like me when ever you see a new font you just donwload it and install it in your computer thinking that you will use it one day in one of your projects but we all know that that day will never not come.</p>\n<p>When picking fonts it is suggested to use only two to three fonts at the most in your projects. The reason for this is that you don't have to load too many fonts and the other that I can think of is that it makes our desing more clean.</p>\n<p>In terms of picking fonts for your projects you can look up <a href=\"https://fonts.google.com\">Google Fonts</a>. Its a very helpful website and I use it always for fonts for my projects. If you select a font and scroll down you will find that there is a section down there which tells you what font to use with the font you have selected here.</p>\n<h2>My Choices</h2>\n<p>For this blog and the portfolio website I selected <code>Meriweather</code> as a secondary font from the Google Fonts and in the pairings section one of the suggestions was <code>Montserrat</code> so I picked <code>Montserrat</code> for the primary font.</p>\n<p>Primary font is the most used font in your project also know as the body font and secondary font is for mainly headings and maybe somehwhere else you want to. You can do as you want with this but it is just what I prefer.</p>\n<pre><code class=\"language-scss\">$font-primary: \"Montserrat\", sans-serif;\r\n$font-secondary: \"Merriweather\", serif;\n</code></pre>\n<h2>Font Base &#x26; Sizes</h2>\n<p>Now the next thing we need is the font base according to which all the font sizes of all the elements like <code>h1</code> and so will be setup.</p>\n<pre><code class=\"language-scss\">// Variables.scss\r\n$font-base-size: 1rem;\r\n\r\n$font-size-sm: $font-base-size * 0.875;\r\n$font-size-lg: $font-base-size * 1.25;\r\n\r\n$font-size-h1: $font-base-size * 2.5;\r\n$font-size-h2: $font-base-size * 2;\r\n$font-size-h3: $font-base-size * 1.75;\r\n$font-size-h4: $font-base-size * 1.5;\r\n$font-size-h5: $font-base-size * 1.25;\r\n$font-size-h6: $font-base-size;\r\n\r\n$line-height: 1.5;\r\n$line-height-sm: 1.25;\r\n$line-height-lg: 2;\n</code></pre>\n<p>Using a base-size now we can change the size of all the elements by only changing the value of the base-size. Note that in the sizes I am using <code>rem</code> units instead of <code>px</code> or <code>em</code>.</p>\n<h2>Using Rem Units</h2>\n<p><code>rem</code> units scale according to the font size of the root element. For example if the roor element is 16 pixels then 1 rem equals 16px and if the root element font size is 18px then 1rem equals 18px and so on. On the other hand <code>em</code> unit scales according to the font size of the parent element. That means that if the parnet element be it a div or span has a font size of 20px then 2em equals 20px.</p>\n<p>There is no particular reason for me using it other than that it feels easeier to work with rem units now that I have gotten used to them.</p>\n<h2>Font Spacing</h2>\n<p>Now that we have setup the font sizing of most of the elements now come the part to decide what spacing/margins should they all have.\r\nFirst of all we need to setup a baseline and that will be 24px and why it is 24px is because of a concept called Vertical Rythem. You can read more about Vertical Rythem here in this <a href=\"https://zellwk.com/blog/why-vertical-rhythms/\">Article</a>.</p>\n<pre><code class=\"language-scss\">$space-base: 24px;\n</code></pre>\n<p>We create a baseline and from that we will define the small, medium, large and extra large baselines and use them according to the element.</p>\n<pre><code class=\"language-scss\">$space-sm: $space-base / 2;\r\n$space-md: $space-base;\r\n$space-lg: $space-base * 2;\r\n$space-xl: $space-base * 3;\n</code></pre>\n<p>Now using these we will add margin bottom to the type elements of HTML mainly headings and paragraph tags.</p>\n<pre><code class=\"language-scss\">h1,\r\nh2 {\r\n  margin-bottom: $space-lg;\r\n}\r\nh3,\r\nh4,\r\nh5,\r\nh6,\r\np {\r\n  margin-bottom: $space-md;\r\n}\n</code></pre>\n","tags":["Design-System","Design","CSS"]}},"__N_SSG":true}